# Data Cleaning and Preparation

During the course of dping data analysis and modeling, a significant amount of time is spent on data preparation: loading, cleaning, transforming, and rearranging. Such tasks are often reported to take up 80% or more of the analyst's time.

pandas, along with the built-in Python languange features, provides a high-level, flexible, and fast set of tools to enable you to manipulate data into the right form.

In [1]:
import pandas as pd
import numpy as np

## Handling and Missing Data

For nmeric data, pandas uses the floating-point value __NaN__ (Not a Number) to represent missing data. We call this a _sentinel value_ that can be easity detected:

In [2]:
string_data = pd.Series(['aardvark','artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

The built-in Python __None__ value is also treated as NA in object arrays:

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

There are a few ways to filter out missing data. While you always have the option to do it by hand using, __pandas.isnull__ and boolean indexing, the __dropna__ can be helpful. 
On a Series, it returns the Series with only the non-null data and index value:

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
3    7.0
dtype: float64

This is equivalent to:

In [10]:
data[data.notnull()]

0    1.0
2    3.5
3    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4]=NA

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7,3))

In [20]:
df.iloc[:4,1]=NA

In [21]:
df.iloc[:2,2]=NA

In [22]:
df

          0         1         2
0 -0.298946       NaN       NaN
1 -1.564636       NaN       NaN
2  1.614981       NaN  0.251661
3 -0.704671       NaN -0.081094
4  0.530527 -0.453173 -1.024434
5 -0.476653 -1.337625 -1.830020
6 -0.215832 -1.253731  0.191425

In [23]:
df.dropna()

          0         1         2
4  0.530527 -0.453173 -1.024434
5 -0.476653 -1.337625 -1.830020
6 -0.215832 -1.253731  0.191425

In [24]:
df.dropna(thresh=2)

          0         1         2
2  1.614981       NaN  0.251661
3 -0.704671       NaN -0.081094
4  0.530527 -0.453173 -1.024434
5 -0.476653 -1.337625 -1.830020
6 -0.215832 -1.253731  0.191425

### Filling In Missing Data

In [25]:
df.fillna(0)

          0         1         2
0 -0.298946  0.000000  0.000000
1 -1.564636  0.000000  0.000000
2  1.614981  0.000000  0.251661
3 -0.704671  0.000000 -0.081094
4  0.530527 -0.453173 -1.024434
5 -0.476653 -1.337625 -1.830020
6 -0.215832 -1.253731  0.191425

In [26]:
df.fillna({1: 0.5,2: 0})

          0         1         2
0 -0.298946  0.500000  0.000000
1 -1.564636  0.500000  0.000000
2  1.614981  0.500000  0.251661
3 -0.704671  0.500000 -0.081094
4  0.530527 -0.453173 -1.024434
5 -0.476653 -1.337625 -1.830020
6 -0.215832 -1.253731  0.191425

In [27]:
_ = df.fillna(0, inplace=True) # replaces the existing object in-place

In [28]:
df

          0         1         2
0 -0.298946  0.000000  0.000000
1 -1.564636  0.000000  0.000000
2  1.614981  0.000000  0.251661
3 -0.704671  0.000000 -0.081094
4  0.530527 -0.453173 -1.024434
5 -0.476653 -1.337625 -1.830020
6 -0.215832 -1.253731  0.191425

In [29]:
df = pd.DataFrame(np.random.randn(6,3))

In [30]:
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA

In [31]:
df

          0        1         2
0 -0.385403 -0.59039  1.550723
1 -0.090580  1.47860  1.291152
2  1.579540      NaN  0.526929
3  1.417139      NaN -1.269305
4  0.970547      NaN       NaN
5 -1.133995      NaN       NaN

In [32]:
df.fillna(method='ffill')

          0        1         2
0 -0.385403 -0.59039  1.550723
1 -0.090580  1.47860  1.291152
2  1.579540  1.47860  0.526929
3  1.417139  1.47860 -1.269305
4  0.970547  1.47860 -1.269305
5 -1.133995  1.47860 -1.269305

In [33]:
df.fillna(method='ffill',limit=2)

          0        1         2
0 -0.385403 -0.59039  1.550723
1 -0.090580  1.47860  1.291152
2  1.579540  1.47860  0.526929
3  1.417139  1.47860 -1.269305
4  0.970547      NaN -1.269305
5 -1.133995      NaN -1.269305

In [34]:
data = pd.Series([1.,NA,3.5,NA,7])

In [35]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

So far we've been concerned with rearranging data. Filtering, cleaning, and other transformations are another class of important operations.

### Removing Duplicates

In [36]:
data = pd.DataFrame({'k1': ['one','two']*3 + ['two'],
                    'k2': [1,1,2,3,3,4,4]})

In [37]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [38]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
data['v1']=range(7)

In [41]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [42]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [43]:
data = pd.DataFrame({'food': ['bacon','pulled pork','bacon',
                             'Pastrami','corned beef','Bacon',
                             'pastrami','honey ham','nova lox'],
                    'ounces': [4,3,12,6,7.5,8,3,5,6]})

In [44]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [45]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [46]:
lowercased = data['food'].str.lower()

In [47]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [48]:
data['animal']=lowercased.map(meat_to_animal)

In [49]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [50]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [51]:
data = pd.Series([1.,-999.,2,-999.,1000.,3.])

In [52]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4    1000.0
5       3.0
dtype: float64

In [53]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4    1000.0
5       3.0
dtype: float64

In [54]:
data.replace([-999,1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [55]:
data.replace([-999,1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [56]:
data.replace({-999: np.nan, -1000:0})

0       1.0
1       NaN
2       2.0
3       NaN
4    1000.0
5       3.0
dtype: float64

### Renaming Axis Indexes

In [57]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = ['Ohio','Colorado','New York'],
                   columns = ['one','two','three','four'])

In [58]:
transform = lambda x: x[:4].upper()

In [59]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [60]:
data.index = data.index.map(transform)

In [61]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [62]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [63]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [64]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [65]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [66]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [67]:
bins = [18,25,35,60,100]

In [68]:
cats = pd.cut(ages,bins)

In [69]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [70]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [71]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [72]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [73]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [74]:
group_names = ['Youth','YoungAdult', 'MiddleAged', 'Senior']

In [75]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [76]:
data = np.random.rand(20)

In [77]:
pd.cut(data, 4, precision=2)

[(0.21, 0.41], (0.79, 0.99], (0.21, 0.41], (0.79, 0.99], (0.6, 0.79], ..., (0.21, 0.41], (0.21, 0.41], (0.6, 0.79], (0.79, 0.99], (0.41, 0.6]]
Length: 20
Categories (4, interval[float64]): [(0.21, 0.41] < (0.41, 0.6] < (0.6, 0.79] < (0.79, 0.99]]

In [78]:
data = np.random.randn(1000) # Normally distributed

In [79]:
cats = pd.qcut(data,4) # Cut into quartiles

In [80]:
cats

[(-0.662, 0.0112], (0.0112, 0.673], (-2.96, -0.662], (0.0112, 0.673], (-0.662, 0.0112], ..., (0.673, 2.701], (0.0112, 0.673], (0.0112, 0.673], (0.0112, 0.673], (0.0112, 0.673]]
Length: 1000
Categories (4, interval[float64]): [(-2.96, -0.662] < (-0.662, 0.0112] < (0.0112, 0.673] < (0.673, 2.701]]

In [81]:
pd.value_counts(cats)

(0.673, 2.701]      250
(0.0112, 0.673]     250
(-0.662, 0.0112]    250
(-2.96, -0.662]     250
dtype: int64

In [82]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-1.222, 0.0112], (0.0112, 1.264], (-1.222, 0.0112], (0.0112, 1.264], (-1.222, 0.0112], ..., (0.0112, 1.264], (0.0112, 1.264], (0.0112, 1.264], (0.0112, 1.264], (0.0112, 1.264]]
Length: 1000
Categories (4, interval[float64]): [(-2.96, -1.222] < (-1.222, 0.0112] < (0.0112, 1.264] < (1.264, 2.701]]

### Detecting and Filtering Outliers

In [83]:
data = pd.DataFrame(np.random.randn(1000,4))

In [84]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.002270    -0.002525     0.003459     0.021724
std       0.990823     1.010352     0.993648     0.995533
min      -3.278372    -3.071939    -3.765390    -3.313815
25%      -0.659020    -0.713741    -0.654750    -0.640042
50%       0.004760    -0.021137     0.012204     0.029633
75%       0.640784     0.687497     0.649146     0.691349
max       2.922069     3.162838     2.924669     3.063468

In [85]:
col = data[2]

In [86]:
col[np.abs(col)>3]

493   -3.476513
773   -3.765390
989   -3.017649
Name: 2, dtype: float64

In [87]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
124 -1.013549  1.664420  0.893894  3.063468
166 -0.335216  3.036984 -0.192545  0.587050
365 -3.278372  0.929647 -0.736261  0.778747
374  0.598088 -1.279349  1.195353 -3.313815
493  1.290910  0.637085 -3.476513  0.553267
588  0.423714 -3.071939  1.157885 -1.826707
700 -1.746677  0.055681  1.326371  3.019395
773 -0.073424  0.375886 -3.765390 -0.659174
941 -0.664584 -3.005124 -0.266361  0.417339
952  0.410229  3.162838 -0.180741 -0.714273
989  0.200739 -0.620720 -3.017649 -0.164513

In [88]:
data[np.abs(data)>3]=np.sign(data)*3

In [89]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.002549    -0.002648     0.004718     0.021955
std       0.989939     1.009512     0.989418     0.994279
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.659020    -0.713741    -0.654750    -0.640042
50%       0.004760    -0.021137     0.012204     0.029633
75%       0.640784     0.687497     0.649146     0.691349
max       2.922069     3.000000     2.924669     3.000000

In [90]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1  1.0 -1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
4 -1.0 -1.0 -1.0 -1.0

### Permutation and Random Sampling

In [91]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [92]:
sampler = np.random.permutation(5)

In [93]:
sampler

array([0, 4, 1, 2, 3])

In [94]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [95]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [96]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7

In [97]:
choices = pd.Series([5,7,-1,6,4])

In [98]:
draws = choices.sample(n=10,replace=True)

In [99]:
draws

3    6
4    4
2   -1
4    4
1    7
1    7
4    4
2   -1
0    5
0    5
dtype: int64

### Computating Indicator / Dummy Variables

"A dummy variable is one that takes the value 0 or 1 to indicate the absence or presence of some categorical effect that may be expected to shift the outcome..."

In [100]:
df = pd.DataFrame({'key': ['b','b','a','c','a','b'],
                  'data1': range(6)})

In [ ]:
pd.get_dummies(df['key'])

In [ ]:
dummies = pd.get_dummies(df['key'],prefix='key')

In [ ]:
df_with_dummy = df[['data1']].join(dummies)

In [ ]:
df_with_dummy

In [ ]:
mnames = ['movies_id','title','genres']

In [ ]:
movies = pd.read_table('../datasets/movielens/movies.dat', sep='::',
                      header=None, names=mnames)

In [ ]:
movies[:10]

In [ ]:
all_genres = []

In [ ]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [ ]:
genres = pd.unique(all_genres)

In [ ]:
genres

In [ ]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [ ]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [ ]:
gen = movies.genres[0]

In [ ]:
gen.split('|')

In [ ]:
dummies.columns.get_indexer(gen.split("|"))

In [ ]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices]=1

In [ ]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [ ]:
movies_windic.iloc[0]

In [ ]:
np.random.seed(12345)

In [ ]:
values = np.random.rand(10)

In [ ]:
values

In [ ]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [ ]:
pd.get_dummies(pd.cut(values,bins))

## String Manipulation

### String Object Methods

In [ ]:
val = 'a,b,  guido'

In [ ]:
val.split(',')

In [ ]:
pieces = [x.strip() for x in val.split(',')]

In [ ]:
pieces

In [ ]:
first, second, third = pieces

In [ ]:
first + '::' + second + '::' + third

In [ ]:
'::'.join(pieces)

In [ ]:
'guido' in val

In [ ]:
val.index(',')

In [ ]:
val.find(':')

In [ ]:
val.count(',')

In [ ]:
val.replace(',','::')

In [ ]:
val.replace(',', '')

### Regular Expressions

In [ ]:
import re

In [ ]:
text = "foo    bat\t baz  \tqux"

In [ ]:
re.split('\s+', text)

In [ ]:
regex = re.compile('\s+')

In [ ]:
regex.split(text)

In [ ]:
regex.findall(text)

In [ ]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@gmail.com
"""
pattern = r'[A-Z0-9.%+-]+@[A-Z0-9.-]+[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern,flags=re.IGNORECASE)

In [ ]:
regex.findall(text)

In [ ]:
m = regex.search(text)

In [ ]:
m

In [ ]:
print(regex.match(text))

In [ ]:
print(regex.sub('REDACTED',text))

In [ ]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [ ]:
regex = re.compile(pattern,flags=re.IGNORECASE)

In [ ]:
m = regex.match('wesm@bright.net')

In [ ]:
m.groups()

In [ ]:
regex.findall(text)

In [ ]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

### Vectorized String Functions in pandas

In [ ]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

In [ ]:
data.str.contains('gmail')

In [ ]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

In [ ]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

In [ ]:
matches.str.get(1)
matches.str[0]

In [ ]:
data.str[:5]